[
    {
        "title": "Software Engineer - Game Services",
        "desc": "Wolfjaw Studios is looking to expand its Game Services team in Troy, NY. As a part of this team, you will be responsible for developing and supporting key features in multiplayer games.About Wolfjaw StudiosWolfjaw Studios has two core competencies serving both large media companies and multiplayer game studios.Our game services team partners with game development studios and publishers to build cloud based services that provide the infrastructure to support core game services, web applications, and marketing activities. Wolfjaw partners with studios and publishers on creating enterprise level services that are unique to each customer needs.Over the years, our team has been trusted to build the systems that power some of the most popular modern multiplayer games. Wolfjaw is relied upon by our customers throughout all stages of the development process as well as during deployment and active operations. On our team, youll have the ability to innovate and invent, helping define the technical foundations of groundbreaking systems.Our immediate need is for engineers to join our Game Services Team.What We Are Looking For:Prior programming experience with Go, C, C++, or C#Experience with containerization and/or cloud-hosted servicesFamiliarity with web, database, and automation technologiesA strong understanding of testing methodologiesDemonstrated problem solving and debugging skillsUnderstanding software development life-cycle processesExperience with version control and build systemsA passion for software development not only in what you know today but what you are looking to learn going forward.Pluses:A passion for playing and making gamesExperience developing in the entertainment or video game industryIn plain English:We are looking for people with a passion for developing software. You have shipped a back end service or two. The ideal candidate will be a curious self starter. You should be willing to put in the time to figure things out but at the same time not afraid to consult the rest of the team for help when you need it. You can manage your own time. You believe in putting your head down and getting things done. At the same time, you know when its time to go home and enjoy your life.What You Get: Competitive salary and benefitsFriendly and supportive colleagues and managersRelaxed environmentOpportunity to make key technical decisions which help define the future of product and infrastructure developmentThe chance to apply your existing knowledge while gaining experience with cutting edge technology and methodologiesJob Type: Full-timePay: $65,000.00 - $100,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insurancePaid time offParental leaveProfessional development assistanceSchedule:Monday to FridaySupplemental Pay:Bonus payExperience:Go: 1 year (Preferred)C: 1 year (Preferred)C++: 1 year (Preferred)Work Location:One locationWork Remotely:YesWork Location: One location",
        "location": "Wolfjaw Studios in Troy, NY 12180"
    },
    {
        "title": "Software Engineer II (Frontend), Money",
        "desc": "As a Web Frontend engineer at Uber, youll create and maintain experiences across some of our 500+ web frontend properties, including marketing pages and signup flows, applications for our millions of riders, drivers and eaters, and our internal business and operations tools that manage our products and logistics worldwide. Youll have the opportunity to impact our core ridesharing business, as well as emerging products like UberEATS, Uber Freight, mapping and self-driving cars.\nAbout the Role\nAs a Frontend Software Engineer on the Orders/Money team, you will be working on a mission-critical area focusing on making sure that our operations and business teams can be as effective and efficient as possible by building a unified commerce platform that is used by many globally, across functions, to support money flows, in and out, at Uber. Our customers and users depend on fast and reliable money movement and our teams play a critical role in making that happen. We believe that by leveraging technology and incredible talent, what this team builds differentiates our offering and will have an immensely positive impact on customer experience and our companys success.\nWhat Yo'll Do\nWill work with a team of engineers and product managers to develop tooling and systems for many different internal customers to gain insight and work with our core Money platform.\nWill be on-call for critical services relied upon by thousands of internal users and indirectly many more customers.\nBasic Qualifications\nBachelors degree or equivalent in Computer Science, Engineering, Mathematics or related field OR 1-year full-time Software Engineering work experience, WHICH INCLUDES 1-year total technical software engineering experience in one or more of the following areas:\nAPI design\nModern javascript\nNote the 1-year total of specialized software engineering experience may have been gained through education and full-time work experience, additional training, coursework, research, or similar (OR some combination of these). The year of specialized experience is not necessarily in addition to the years of Education & full-time work experience indicated.\nPreferred Qualifications\nExperience working with modern js framework\nDemonstrated proficiency with UX\nStatic typing systems\nExperience working in full stack environments\nFor Colorado-based applicants: Please refer to this role in our careers page for more details on your total compensation and benefits package. You can get there by clicking apply if youre not already on our careers site. #LI-Remote",
        "location": "Chicago"
    },
    {
        "title": "Software Developer (No Prior Experience Required)",
        "desc": "Revature will hire over 300 new Software Developers in the next 4 weeks. As the largest employer of emerging tech talent, we are looking for candidates all around the U.S.\nOne day someone is going to ask you where you got your startThis is IT!\nWith a wide range of Fortune 500 enterprises, government organizations and top systems integrators as our clients, we not only provide you with the skills needed to succeed through an employer-paid training program but will also give you the opportunity to put those skills to use, on projects that matter.\nWhat We Are Looking For\nCollege degree (Associates or Bachelors)\nMust be authorized to work in the US\nStrong desire to learn to code  No prior professional experience required.\nA natural problem solver\nStrong communication and interpersonal skills\nWilling to relocate anywhere in the US  Relocation assistance provided\nWhat We Offer\nCompetitive salary\nRelocation & housing assistance\nHealth, vision & dental insurance\nPaid time off\nIndustry Certifications\nLife Insurance Policy\n401k\nMentoring program and ongoing support throughout your entire Revature career\nExperience with the largest and most reputable companies in the US\nApply Today. Interviews are going on now.\n#SoftwareEngineering\nEqual Employment Opportunity\nThe Company is an equal opportunity employer. We will extend equal opportunity to all individuals without regard to race, religion, color, sex, pregnancy, childbirth or related medical conditions, sexual orientation, gender identity, national origin, disability, age, genetic information, marital status, veteran status, or any other status protected under applicable federal, state, or local laws. This policy applies to all terms and conditions of employment, including but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, benefits, compensation and training. If you require an accommodation to work based on any of these protected factors, please notify the Human Resources Department, and the Company will evaluate the request and provide an accommodation in accordance with applicable law.\nWe seek to comply with all applicable federal, state and local laws related to discrimination and will not tolerate the interference with the ability of any of the Companys employees to perform their job duties. Our policy reflects and affirms the Companys commitment to the principles of fair employment and the elimination of all discriminatory practices.",
        "location": "San+Francisco"
    },
    {
        "title": "Entry Level Software Engineer",
        "desc": "Opanga Networks is seeking a talented software engineer with the right aptitude and attitude to join our ever-expanding team. Opanga is a growing company on the cutting edge of network management technologies for wireless networks. Our team creates a variety products based on our core data delivery technology including next generation SDN / NFVapplications, mobile applications for API frameworks for Android and Back-end server systems and web applications.What should you expect as an Opanga Software Engineer?As a member of the Opanga team you will take design requirements and convert them to high quality JAVA/C++ code in a timely manner.You will work with a team of professional software engineers to deliver top-quality software to our end users. You will participate in the full life cycle of our products including design, development, code reviews, patent creation and write up, test and documentation.We asked our engineers what they loved about their roles at Opanga, and here is what they said:Contribute meaningfully to new and already-deployed business-critical network optimization solutions with a global reach.Coordinate the operations of new and existing customer deployments.Work closely with product owners to define the scope of work for upcoming releases.Develop high-performance, network-level software running on bare-metal and virtual environments.Evolve solutions for monitoring and management as well as big data sourcing, processing, and visualization.Build and improve both small and large scale testing tools, frameworks, and methodologies that support our products.Challenge yourself by exercising self-driven learning and team problem-solving on a daily basis.Cultivate a broad scope of technical and non-technical skills driven by a lively startup culture.Share findings, knowledge, and experiences with other team members.Flexible, friendly work atmosphereSome of the things you might find on an Opanga Networks employees resume include:Designed and implemented a scalable NFV deployment, using OpenStack for a high-performance network environment This design was used to deploy company optimization technology across multiple countries and millions of subscribers.Improved the build process to automatically deploy software onto virtualized infrastructure to perform a gamut of regression and performance tests using Jenkins, Ansible and OpenStack.Designed and implemented a rigorous black-box testing suite in Python for a C software library with hundreds of thousands of lines of code.This is just a small sampling of the tasks that youwill be met with on a daily basis at Opanga. Are you up for the challenge?Requirements: 0-2 years experience in software development utilizing JAVA/Javascript or C/C++A working knowledge of Python/Bash scripting and OS ManagementUnderstanding of object oriented coding,threading, synchronizationExcellent communication and interpersonal skillsTo apply for this position, please send a cover letter and resume.Job Type: Full-timeExperience:Software Development: 1 year (Preferred)Education:Associate (Preferred)Location:Seattle, WA 98104 (Required)Work authorization:United States (Required)Application Question:Will you now or in the future require sponsorship for employment visa status (e.g., H-1B visa status)?Work Location:One locationSchedule::Monday to Friday",
        "location": "Seattle"
    },
    {
        "title": "newEmbedded Software Engineer (Junior)",
        "desc": "ABOUT BIONAUT LABSAt Bionaut Labs, we have embarked on a unique voyage inside the human body. We are developing miniature remote-controlled robots that can navigate through tissue and target key anatomic locations in the body, for therapeutic or diagnostic purposes.Bionaut Labs is creating our software team and is looking for an early-career embedded-systems engineer. This is an opportunity to create a game-changing medical system by using modern development practices and evolving a highly collaborative team environment.RESPONSIBILITIES INCLUDE:Develop the safety-critical Bionaut mission software Write software primarily in Rust, and incorporate libraries of C and C++ code Develop test-first (TDD) with strong unit and integration testing Team with verification engineers to develop automated verification tests Using functional programming and object-oriented approaches Identify and champion best-in-class tools and approachesBe a part of creating a world-class development experience Work as a member of a collaborative development team, using Mob Programming.(Prior Mob or Pair Programming experience not required) Be a positive team member, fostering an open and psychologically safe culture Incrementally improve team approaches using retrospectives and experiments Learn frequently in group and individual activities; teach and mentor othersControl Bionaut hardware Work at the metal creating device drivers and interacting with an RTOS Collaborate with algorithm researchers and convert the mathematical research code into reliable and efficient production code Utilize electronics analysis tools, including logic and network analyzersCreate a safe and reliable device Participate in risk analysis activities Learn and apply safe-by-design approaches Participate and improve regulatory facing effortsQUALIFICATIONS Bachelors degree (or better) in Computer Science, Computer Engineering, or another applicable Engineering or Applied Sciences discipline. Zero to five years of related experience developing device software.REQUIRED SKILLSLanguages C/C++ family languages Rust  willingness to learn; prior experience not required, but very nice to have Python  working knowledge neededDevelopment Approaches Functional Programming Object-Oriented ProgrammingDomain Embedded systemsTools & Technologies Register level at-the-metal driver development, including A/D & D/A Converters, and Serial protocols (I2C, SPI, RS-232/485) Working with a Real Time Operating System (ThreadX, FreeRTOS, etc) Embedded systems tooling, including some of: Logic analyzers, Network analyzers, OscilloscopeNICE TO HAVE SKILLSLanguages Functional programming language, such as Clojure, Haskell, Elm, OCaml, F#, SchemeDevelopment Approaches Test-Driven Development Behavior Driven Development (BDD) Domain Driven Design (DDD) Pair-Programming and/or Mob Programming Extreme ProgrammingDomain High-reliability and/or fault-tolerant embedded systems Regulated environments, Medical preferredTools & Technologies Embedded/Real-Time Linux  nice to have PI and/or PID control, and Kalman filters Digital Signal Processing Continuous Integration/Continuous Delivery tools (Jenkins, Github Actions, etc) Real-time ethernet Other network technologies ARM M-series processors (STM32, etc) Medical imaging technology (DICOM) Active Object concurrency modelJob Type: Full-timePay: $80,000.00 - $150,000.00 per yearBenefits:401(k)Dental insuranceFlexible scheduleHealth insuranceLife insurancePaid time offRelocation assistanceVision insuranceSchedule:Monday to FridayCOVID-19 considerations:We follow all health regulations for Covid19, and are operating as an essential business (medical device company)Application Question(s):What is your GPA in the most recent degree you completed?Education:Bachelor's (Required)Willingness to travel:25% (Preferred)Work Location: One location",
        "location": "3767 Overland Avenue, Los Angeles, CA 90034"
    },
    {
        "title": "Entry Level Software Engineer",
        "desc": "As a leader in recruiting emerging technology talent across the country, Revature is looking forward to hiring over 300 new Entry Level Software Engineers in the next 4 weeks.\nOne day someone is going to ask you where you got your startThis is IT!\nWith a wide range of Fortune 500 enterprises, government organizations and top systems integrators as our clients, we not only provide you with the skills needed to succeed through an employer-paid training program (10-12 weeks), but will also give you the opportunity to put those skills to use, on projects that matter.\nRevature has been featured in the Wall Street Journal, Money, Time, and MSN, and was recently named as one of the Top 15 Companies that Hire in 15 Days or Less by Glassdoor.\nWhat We Are Looking For\nCollege degree (Associates or Bachelors)\nStrong desire to learn to code  No prior professional experience required.\nA natural problem solver\nStrong communication and interpersonal skills\nWilling to relocate anywhere in the US  Relocation assistance provided\nMust be authorized to work in the US (US Citizen or Green Card holder)\nWillingness to commit to a role for a minimum of 2 years.\nWhat We Offer\nCompetitive salary\nRelocation & housing assistance\nHealth, vision & dental insurance\nPaid time off\nIndustry Certifications\nLife Insurance Policy\n401k\nMentoring program and ongoing support throughout your entire Revature career\nExperience with the largest and most reputable companies in the US\nApply Today. Interviews are going on now.\nEqual Employment Opportunity\nThe Company is an equal opportunity employer. We will extend equal opportunity to all individuals without regard to race, religion, color, sex, pregnancy, childbirth or related medical conditions, sexual orientation, gender identity, national origin, disability, age, genetic information, marital status, veteran status, or any other status protected under applicable federal, state, or local laws. This policy applies to all terms and conditions of employment, including but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, benefits, compensation and training. If you require an accommodation to work based on any of these protected factors, please notify the Human Resources Department, and the Company will evaluate the request and provide an accommodation in accordance with applicable law.\nWe seek to comply with all applicable federal, state and local laws related to discrimination and will not tolerate the interference with the ability of any of the Companys employees to perform their job duties. Our policy reflects and affirms the Companys commitment to the principles of fair employment and the elimination of all discriminatory practices.\n\"",
        "location": "Philadelphia"
    },
    {
        "title": "Software Engineer",
        "desc": "POSITION:  SOFTWARE ENGINEERREPORTS TO: CONVEYOR ENGINEERING LEADFLSA STATUS: SALARIED, EXEMPTGENERAL DESCRIPTION: The Interroll Group is one of the worlds leading specialists within the field of internal logistics. Headquartered in Switzerland, the exchange-listed company employs around 2,300 people at 32 enterprises around the globe. Among the companys 23,000 customers are plant manufacturers, system integrators and equipment manufacturers. Our products are in daily use by global brands everyone knows, like Amazon, Bosch, Coca-Cola, DHL, Procter & Gamble, Red Bull, Siemens, Walmart and Yamaha (Motorcycles). On top of that, Interroll initiates global research projects for logistics efficiency and is actively supporting industry associations for standards or better use of resources.DUTIES AND RESPONSIBILITIES: Design, develop and implement Office 365 applications and solutions and implement custom-designed forms and applications using data stored in SharePoint Online using Power Apps.Analyze the business requirements by collaborating with the stakeholders and business teams, supporting standard work, work instructions, and work processes.Provide technical advice and recommendations to team members and customers on best practices for SharePoint Online / Power Apps during solution gathering.Collaborating with the engineering team to provide manufactory solutions such as scanning, Inventory management, quality controls, etc. REQUIRED QUALIFICATIONS: Always possess and display Interroll LLCs Guiding Principles:IntegrityTeamworkProfessionalismInnovationAccountabilityBA or BS degree required in software engineer or related field.3+ years of experience with software development or SharePoint development.Experience with developing, maintaining, and updating the content of websites.Experience with developing code and maintaining web-based applications.Manufacturing experience is a plus.EDUCATION: Bachelor of Arts or Bachelor of Science degree in Software Engineering.The above statements reflect the general details considered necessary to describe the principal function of the job identified and shall not be construed as a detailed description of all the work requirements that may be inherent in this job.Job Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceDisability insuranceEmployee assistance programEmployee discountFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offProfessional development assistanceReferral programTuition reimbursementVision insuranceSchedule:8 hour shiftMonday to FridaySupplemental Pay:Bonus payEducation:Bachelor's (Preferred)Experience:Application Engineering: 3 years (Preferred)Work Location:One locationWork Remotely:NoWork Location: One location",
        "location": "159 Corporate Dr, Hiram, GA 30141"
    },
    {
        "title": "Software Developer (No Prior Experience Required)",
        "desc": "Revature will hire over 300 new Software Developers in the next 4 weeks. As the largest employer of emerging tech talent, we are looking for candidates all around the U.S.\nOne day someone is going to ask you where you got your startThis is IT!\nWith a wide range of Fortune 500 enterprises, government organizations and top systems integrators as our clients, we not only provide you with the skills needed to succeed through an employer-paid training program but will also give you the opportunity to put those skills to use, on projects that matter.\nWhat We Are Looking For\nCollege degree (Associates or Bachelors)\nMust be authorized to work in the US\nStrong desire to learn to code  No prior professional experience required.\nA natural problem solver\nStrong communication and interpersonal skills\nWilling to relocate anywhere in the US  Relocation assistance provided\nWhat We Offer\nCompetitive salary\nRelocation & housing assistance\nHealth, vision & dental insurance\nPaid time off\nIndustry Certifications\nLife Insurance Policy\n401k\nMentoring program and ongoing support throughout your entire Revature career\nExperience with the largest and most reputable companies in the US\nApply Today. Interviews are going on now.\n#SoftwareEngineering\nEqual Employment Opportunity\nThe Company is an equal opportunity employer. We will extend equal opportunity to all individuals without regard to race, religion, color, sex, pregnancy, childbirth or related medical conditions, sexual orientation, gender identity, national origin, disability, age, genetic information, marital status, veteran status, or any other status protected under applicable federal, state, or local laws. This policy applies to all terms and conditions of employment, including but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, benefits, compensation and training. If you require an accommodation to work based on any of these protected factors, please notify the Human Resources Department, and the Company will evaluate the request and provide an accommodation in accordance with applicable law.\nWe seek to comply with all applicable federal, state and local laws related to discrimination and will not tolerate the interference with the ability of any of the Companys employees to perform their job duties. Our policy reflects and affirms the Companys commitment to the principles of fair employment and the elimination of all discriminatory practices.",
        "location": "Dallas"
    },
    {
        "title": "Entry Level Software Engineer",
        "desc": "As a leader in recruiting emerging technology talent across the country, Revature is looking forward to hiring over 300 new Entry Level Software Engineers in the next 4 weeks.\nOne day someone is going to ask you where you got your startThis is IT!\nWith a wide range of Fortune 500 enterprises, government organizations and top systems integrators as our clients, we not only provide you with the skills needed to succeed through an employer-paid training program (10-12 weeks), but will also give you the opportunity to put those skills to use, on projects that matter.\nRevature has been featured in the Wall Street Journal, Money, Time, and MSN, and was recently named as one of the Top 15 Companies that Hire in 15 Days or Less by Glassdoor.\nWhat We Are Looking For\nCollege degree (Associates or Bachelors)\nStrong desire to learn to code  No prior professional experience required.\nA natural problem solver\nStrong communication and interpersonal skills\nWilling to relocate anywhere in the US  Relocation assistance provided\nMust be authorized to work in the US (US Citizen or Green Card holder)\nWillingness to commit to a role for a minimum of 2 years.\nWhat We Offer\nCompetitive salary\nRelocation & housing assistance\nHealth, vision & dental insurance\nPaid time off\nIndustry Certifications\nLife Insurance Policy\n401k\nMentoring program and ongoing support throughout your entire Revature career\nExperience with the largest and most reputable companies in the US\nApply Today. Interviews are going on now.\nEqual Employment Opportunity\nThe Company is an equal opportunity employer. We will extend equal opportunity to all individuals without regard to race, religion, color, sex, pregnancy, childbirth or related medical conditions, sexual orientation, gender identity, national origin, disability, age, genetic information, marital status, veteran status, or any other status protected under applicable federal, state, or local laws. This policy applies to all terms and conditions of employment, including but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, benefits, compensation and training. If you require an accommodation to work based on any of these protected factors, please notify the Human Resources Department, and the Company will evaluate the request and provide an accommodation in accordance with applicable law.\nWe seek to comply with all applicable federal, state and local laws related to discrimination and will not tolerate the interference with the ability of any of the Companys employees to perform their job duties. Our policy reflects and affirms the Companys commitment to the principles of fair employment and the elimination of all discriminatory practices.\n\"",
        "location": "Pittsburgh"
    },
    {
        "title": "Software QA Engineer",
        "desc": "At Siemens, we are always challenging ourselves to build a better future. We need the most innovative and diverse Digital Minds to develop tomorrows reality. Find out more about the Digital world of Siemens here: www.siemens.com/careers/digitalminds\nSiemens EDA  A Siemens Business, is a global technology leader in Electronic Design Automation, providing software solutions that help engineers around the world design and manufacture new and highly innovative electronic products. Each year, our customers use our tools to push the boundaries of technology and physics in order to deliver smaller, faster and more reliable products that run the worlds high tech devices.\nPosition Overview\nWe are looking for a highly motivated software quality engineer to join the Calibre Design for Manufacturability (DFM) team, ensuring that our EDA software product remains the best in the industry. DFM is about developing closer associations between the design world and the manufacturing world. The goal is to help layout design engineers choose strategies that result in more manufacturable (higher yielding) layout configurations. Calibre YieldAnalyzer and YieldEnhancer provide a set of Standard Verification Rule Format (SVRF) statements and operations you can use to develop DFM rule files that use the same tools and processes that designers already use for standard Design Rules Checking (DRC).\nResponsibilities\nYou will be part of a team responsible for testing, debugging and qualifying software releases and updates. Quality assurance responsibilities include:\nInvolved in the design, development, and execution of functional and regression tests used to measure correctness, robustness, performance, and overall quality.\nCollaborate with senior software engineers, quality assurance specialists, marketing, and customer support professionals to help deliver timely product releases that meet our customers needs.\nProvide all partners with appropriate regression reports in a timely manner.\nEncouraged to take advantage of opportunities provided to improve technical and job related skills; such as developing additional product breadth and business skills!\nUse your leadership and innovation, to develop procedures and tools needed to improve the QA process and assist developers in making design trade-offs and risk analysis assessments.\nThis position requires employees to be fully vaccinated against COVID-19 unless they are granted a medical or religious exemption\nRequired Knowledge/Skills, Education, and Experience:\nTechnical degree in Electrical Engineering/Computer Engineering/Computer Science or equivalent.\nExperience working in a Linux environment\nKnowledge of software quality assurance processes and experience with maintaining regression test suites.\nSelf-motivated and able to work independently\nPossess a positive, can-do demeanor and capable of balancing multiple QA projects effectively and simultaneously.\nPreferred Knowledge/Skills, Education, and Experience:\nKnowledge of a scripting language (Python, Perl, Tcl, etc.)\nExposure to EDA verification tools like Calibre DRC\nExperience developing or testing products which were written in an object oriented language\nBasic knowledge of IC manufacturing process flows\nExperience with Calibre SVRF for DRC is a strong plus\n\nIf yo're reading this and questioning whether you should apply, apply! There's no such thing as a perfect candidate, and we don't expect you to check every box. We're passionate about the uniqueness that people like you bring to the table. The companies that we incubate are only as innovative as the breadth of lived experiences shared by the teams building them. We can't wait to read your application.\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n#LI-MGRP\n#LI-KM1\nOrganization: Digital Industries\nCompany: Siemens Industry Software Inc.\nExperience Level: Experienced Professional\nJob Type: Full-time\nEqual Employment Opportunity Statement\nSiemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.\n\nEEO is the Law\nApplicants and employees are protected under Federal law from discrimination. To learn more, Click here.\n\nPay Transparency Non-Discrimination Provision\nSiemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.\n\nCalifornia Privacy Notice\nCalifornia residents have the right to receive additional notices about their personal information. To learn more, click here.",
        "location": "Portland"
    },
    {
        "title": "Software Developer (No Prior Experience Required)",
        "desc": "Revature will hire over 300 new Software Developers in the next 4 weeks. As the largest employer of emerging tech talent, we are looking for candidates all around the U.S.\nOne day someone is going to ask you where you got your startThis is IT!\nWith a wide range of Fortune 500 enterprises, government organizations and top systems integrators as our clients, we not only provide you with the skills needed to succeed through an employer-paid training program but will also give you the opportunity to put those skills to use, on projects that matter.\nWhat We Are Looking For\nCollege degree (Associates or Bachelors)\nMust be authorized to work in the US\nStrong desire to learn to code  No prior professional experience required.\nA natural problem solver\nStrong communication and interpersonal skills\nWilling to relocate anywhere in the US  Relocation assistance provided\nWhat We Offer\nCompetitive salary\nRelocation & housing assistance\nHealth, vision & dental insurance\nPaid time off\nIndustry Certifications\nLife Insurance Policy\n401k\nMentoring program and ongoing support throughout your entire Revature career\nExperience with the largest and most reputable companies in the US\nApply Today. Interviews are going on now.\n#SoftwareEngineering\nEqual Employment Opportunity\nThe Company is an equal opportunity employer. We will extend equal opportunity to all individuals without regard to race, religion, color, sex, pregnancy, childbirth or related medical conditions, sexual orientation, gender identity, national origin, disability, age, genetic information, marital status, veteran status, or any other status protected under applicable federal, state, or local laws. This policy applies to all terms and conditions of employment, including but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, benefits, compensation and training. If you require an accommodation to work based on any of these protected factors, please notify the Human Resources Department, and the Company will evaluate the request and provide an accommodation in accordance with applicable law.\nWe seek to comply with all applicable federal, state and local laws related to discrimination and will not tolerate the interference with the ability of any of the Companys employees to perform their job duties. Our policy reflects and affirms the Companys commitment to the principles of fair employment and the elimination of all discriminatory practices.",
        "location": "Phoenix"
    },
    {
        "title": "Senior Embedded Flight Software Engineer",
        "desc": "Established in 1995, ASI consists of a team of highly talented and motivated professionals working on complex spacecraft systems and software solutions. Join us, and work in a fast-paced innovative environment developing leading edge spacecraft flight software for commercial and government programs. Contribute to the design, development, integration, and testing activities of embedded software for spacecraft command and control.Required QualificationsProficiency in C++Development experience with real-time embedded softwareAbility to write clear, well-tested, well-documented softwareExcellent communications skills, both written and verbalResponsibilitiesDeveloping and testing embedded spacecraft flight softwareIntegration of software with spacecraft hardware componentsSupporting the software development and integration for mission planning, spacecraft operation, and data processing systemsPerforming simulation and hardware-in-the-loop testingWorking in a team environment as well as individuallySupporting design reviews and other customer-facing meetingsRequired Education & ExperienceB.A. or B.S. in Computer Science, Aerospace Engineering, Electrical Engineering, Math or Physics with significant computer science coursework. Advanced degree desired.At least 2 years of relevant work experience, including development in C++ in real-time embedded systems.Benefits: Salary and benefits are market competitive.100% paid PPO medical benefits plan for employees + familyYearly Profit Share & BonusesTo conform to U.S. Government space technology export regulations, including the International Traffic in Arms Regulations (ITAR) you must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State.Job Type: Full-timePay: $85,000.00 - $150,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insuranceLife insurancePaid time offProfessional development assistanceRetirement planTuition reimbursementVision insuranceSchedule:8 hour shiftSupplemental Pay:Bonus payExperience:C++: 2 years (Preferred)RTOS: 2 years (Preferred)Embedded software: 2 years (Preferred)Work Location: One location",
        "location": "Advanced Solutions, Inc in Littleton, CO 80127"
    },
    {
        "title": "newMRS Staff Software Engineer",
        "desc": "Job Profile Summary\nModel Runtime Service (MRS) is a grid-based distributed computation environment responsible for running mission-critical pricing and risk calculations using our proprietary pricing libraries. The implementation platform chosen for MRS is Microsoft HPC on AWS. Development is mainly done with C# .NET framework, JavaScript and Ansible. We are looking for an experienced C# developer to take a lead position in the ongoing development and DevOps activities of MRS.\n\nJob Advert\nKey Accountabilities\nWork within a business facing development team to deliver new solutions to the front office teams across internal businesses such as Oil, International Gas and North American Power & Gas\nMonitor and intervene as needed during the day and the End-of-Day (EOD) process to ensure MRS is 100% available to internal customers\nWork with other developers, quantitative analysts, and business users as part of a wider team\nContribute to analysis, design and development of systems, business processes, and user interfaces\nEssential Education\nComputer Science or other technical (e.g., Physics, Engineering) degree or equivalent commercial experience\nEssential Skills/Experience\nExceptional development skills in C# and .NET platform\nProfessional experience with frontend development technologies (JavaScript, TypeScript, Angular, etc.)\nDemonstratable experience in cloud environments provisioning (AWS, Azure, etc.) using public APIs\nExperience with Linux and Microsoft HPC environments\nConfident in writing and debugging concurrent and multithreaded services on .NET platform in a distributed computing environment\nStrong understanding and hands-on practice of object-oriented programming, design patterns and software development best practices\nDesirable Criteria\nExperience with continuous integration tools such as (Jenkins, TeamCity, Ansible)\nExperience in working with (or using) C++ native libraries is a big PLUS\nGood understanding of pricing and risk calculations concepts in derivatives world is a big PLUS.\nPrevious experience working with the development and DevOps of similar grid-based distributed systems is a big PLUS\nExperience of Agile methodology and the full development cycle\nWhy join us?\nAt bp, we support our people to learn and grow in a diverse and exciting environment. We believe that our team is strengthened by diversity. bp is committed to encouraging an inclusive environment in which everyone is respected and treated fairly. There are many aspects of our employees lives that are meaningful, so we offer benefits to enable your work to fit with your life. These benefits can include flexible working options, a generous paid parental leave policy, excellent retirement benefits, and more!\n#digitalengineering\n\nEntity\nInnovation & Engineering\n\nJob Family Group\nIT&S Group\n\nRelocation available\nNo\n\nTravel required\nNo\n\nTime Type\nFull time\n\nCountry\nUnited States of America\n\nAbout BP\nINNOVATION & ENGINEERING\n\nJoin us in creating, growing, and delivering innovation at pace, enabling us to thrive while transitioning to a net zero world. All without compromising our operational risk management.\n\nWorking with us, you can do this by:\n\ndeploying our integrated capability and standards in service of our net zero and safety ambitionsdriving our digital transformation and pioneering new business modelscollaborating to deliver competitive customer-focused energy solutionsoriginating, scaling and commercialising innovative ideas, and creating ground-breaking new businesses from themprotecting us by assuring management of our greatest physical and digital risks\nBecause together we are:\n\nOriginators, builders, guardians and disruptorsEngineers, technologists, scientists and entrepreneursEmpathetic, curious, creative and inclusive\nLegal disclaimer\nIf you are selected for a position in the United States, your employment will be contingent upon submission to and successful completion of a post-offer/pre-placement drug test(and alcohol screening/medical examination if required by the role) as well as pre-placement verification of the information and qualifications provided during the selection process. The drug screen requires a hair test for which BP must be able to obtain a sufficient hair sample for analysis (~4 cm/1  scalp, or > 2 cm/ body  arms & armpits/legs/chest)\n\nAs part of our dedication to the diversity of our workforce, BP is committed to Equal Employment Opportunity. Applicants will receive consideration for employment without regard for race, color, gender, religion, national origin, disability, veteran status, military status, age, marital status, sexual orientation, gender identity, genetic information or any other protected group status. We are also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us or have one of your representatives contact us at BPUSApplicationAssis@bp.com; or by telephone at 281.366.1999\n\nRead the Equal Employment Opportunity is the Law poster and the poster supplement - for more information about Equal Employment Opportunities. (Spanish version)\n\nBP is an equal employment opportunity and affirmative action employer. View our policy statement",
        "location": "Houston"
    },
    {
        "title": "Software Engineer",
        "desc": "COMPANY SUMMARYThe Body Art Alliance (BAA) is at the forefront of innovation, creating the tools and products to better serve our artist. From the first truly wireless tattoo machine to the groundbreaking novel tattoo parlor on a cruise ship, BAA has cultivated the industry and been the first of many.. We are dreamers, artists, creatives, innovators, and pioneers, driven to propel the body art community across the world.Were here to elevate, empower and take our industry to the next level. Our family of brands will continue to be led by their day one founders and continue to create and oversee our innovative product lines. While we are better united, our brands will always have that special touch that makes them unique. Our new partnership will allow us to create, design and manufacture products, create best-in-class educational content that transcends, and have a direct social impact in the communities we serve.The Body Art Alliance welcomes you home! Discover all that we offer and join our winning team!ROLE: The Software Engineer will have strong, firsthand technical expertise in a variety of configuration management and big data technologies, and the proven ability to develop robust, scalable solutions that can manage large data sets.ESSENTIAL FUNCTIONS:  Collaborates with clients and/or internal teams to understand user needs; drafts initial proposal and design of software to meet these needs. Assists in the development of information systems by designing, developing, and installing software solutions. Analyzes, designs and develops tests and test-automation suites. Develops software solutions by studying information needs, conferring with users, and studying systems flow, data usage, and work processes. Investigates problem areas. Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code. Prepares and installs solutions by determining and designing system specifications, standards, and programming. Improves operations by conducting systems analysis and recommending changes in policies and procedures. Protects operations by keeping information confidential. Provides information by collecting, analyzing, and summarizing development and service issues. Provides recommendations for continuous improvement. Works alongside other engineers on the team to elevate technology and consistently apply best practices. Performs other duties as assigned.SKILLS:  Excellent verbal & written communication skills. Active listening skills. Customer driven. Software design, debugging & testing. Software development fundamentals & process.Excellent problem-solving and analytical skills. Excellent organizational skills and attention to detail. Excellent time management skills with the proven ability to meet deadlines. Extensive knowledge of coding languages and systems. Ability to learn new coding languages and technologies. Ability to work effectively as a member of a team. Ability to work under pressure and apply flexibility as needed to achieve Company goals.KEY PERFORMANCE INDICATORS (KPI):  The application of time management skills and the proven ability to meet deadlines. The ability to create deliverables that contribute to the financial success of the business, and remain in budget. The cultivation of Interpersonal relationships, building and maintaining strong lines of communication and teamwork across all levels of the organization.QUALIFICATIONS AND EDUCATION REQUIREMENTS:  Bachelors in Computer Science, Computer Engineering or related technical discipline. 3+ years of professional software development experience. Proficiency in Java or C++, and object-oriented design skills. Experience in development of distributed/scalable systems and high-volume transaction applications. Knowledge of professional software engineering and best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing and operations. Experience in application architecture and design patterns.PHYSICAL REQUIREMENTS:  Prolonged periods of sitting at a desk and working on a computer Must be able to lift up to 15 pounds if needed.TOTAL REWARDSWe are constantly adapting to provide our employees with an optimal workplace. We believe that your work should be engaging and rewarding. Below are just a few of the benefits to our employees: Medical, dental and vision offerings Company paid Short-term & Long-term Disability 401(K) employer match up to 4%! 100% employer paid life insurance Paid time off in addition to paid holidays Wellness Program Incentive Programs Employee Referral Program Bright Ideas ProgramAt Body Art Alliance (BAA), we dont just accept difference  we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products, and the community we serve. BAA is proud to be an equal opportunity employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.Job Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceHealth insuranceLife insurancePaid time offVision insuranceSchedule:8 hour shiftWork Location:One locationWork Remotely:NoWork Location: One location",
        "location": "1771 NW 79th Ave, Doral, FL 33126"
    },
    {
        "title": "Software Engineer",
        "desc": "Description:\n\nRKF Engineering specializes in the design of next generation communication systems and software for todays most advanced satellite and terrestrial communication networks. Based in Bethesda MD, RKF is seeking exceptional software and communications developers to work in a dynamic team environment on an array of challenging problems. Our firm is always seeking experienced and innovative individuals who are looking for an exciting challenge.\nRKF is seeking an enthusiastic, driven engineer who is looking for a challenge to work on unique and challenging projects\nResponsibilities:\nWrite software tools for web GUI interface (Typescript, React)\nMaintain and write REST API services (Python Flask, C++)\nModify C++ code\nProvide support across multiple projects\n. Requirements:\n\nRequirements:\nSecret level clearance\nFamiliarity with Linux environment and server tools Familiarity with GIS tools and concepts\nStrong Coding skills to include, C++, Python\nPrevious experience developing with Single Page Application Web Framework (React, Angular, Vue)\nPrevious experience working on a Full Stack development\nPreferred Supplemental Skill Sets:\nFamiliarity with managing RedHat or Centos\nKnowledge of Google Maps Web API\nKnowledge of wireless communication technology\nKnowledge of SQL databases\nKnowledge of a message broker (RabbitMQ)\nEducation and Experience:Bachelors or higher in a STEM field, preferably Electrical Engineering or related technical education with demonstrated experience.Having a background in Physics is a plus.2-3 years experience in the above requirements preferredAbility to work independently as well as with a team.\nCandidates must have a proven ability to work both independently and in a team environment, strategize on complex problems, and think outside the box to find solutions. Strong communication and writing skills are an absolute must. Candidates must also be self-motivated and self-managing of their workload and deliverable deadlines.\nIf this sounds like you and you enjoy working in a small company where every day is new, you see the impact of your contributions, and can collaborate with the best in the field, then please apply.",
        "location": "Washington+DC"
    },
    {
        "title": "Jr Software Engineer - Backend",
        "desc": "About the role:\nCollaborates with stakeholders within the team to build and maintain backend services and solutions to support user-facing products, downstream services, or infrastructure tools and platforms used across Uber.\nAbout the Team:\nWhether engineering more accurate ETAs or helping drivers navigate to the perfect pick-up spot, our mapping technologies are integral to the magic of the Uber platform. On the Maps Engineering team, we use the latest ML, GPS, and telematics solutions. We run Big Data pipelines and maintain services that serve tens of thousands of requests per second. This is all to make transportation on our platform safer and more accessible!\nWhenever you see a map, get an ETA, see the route a driver or courier is taking, or get picked up at the right location in an Uber product, it is being powered by the Maps Engineering team. We have multiple roles across Maps including Basemaps, Geofences and Tolls and Surcharges. As a part of the team, yo'll have a chance to work on the systems that are at the core of the services Uber provides. Your work will directly impact the millions of people who rely on Uber each and every day!\nMinimum qualifications:\nBachelors degree or equivalent in Computer Science, Engineering, Mathematics or related field OR 1-year full-time Software Engineering work experience, WHICH INCLUDES 1-year total technical software engineering experience in one or more of the following areas:\nProgramming language (e.g. C, C++, Java, Python, or Go)\nNote the 1-year total of specialized software engineering experience may have been gained through education and full-time work experience, additional training, coursework, research, or similar (OR some combination of these). The year of specialized experience is not necessarily in addition to the years of Education & full-time work experience indicated.\nTechnical skills:\nPreferred:\nScalability engineering\nDistributed systems\nProduct engineering\nExperience with any of the following: scalable, systems and services; SQL/NoSQL data stores like MySQL, HBase, Cassandra, HDFS; Spark, EMR, S3; messages queues like Kafka; geo-replication and consistency/availability trade-offs; and service-oriented-architectures.\nExperience or passion for working on systems related to maps\nFor Colorado-based roles: The salary/hourly rate range for this role is $123,930 per year - $137,700 per year. You will be eligible to participate in Uber's bonus program, and may be offered an equity award, commissions, & other types of comp. You will also be eligible for various benefits. More details about our company benefits can be found at the following link: https://www.uber.com/careers/benefits.\nPlease refer to this role in our careers page for more details on your total compensation and benefits package. You can get there by clicking apply if youre not already on our careers site.",
        "location": "Boulder"
    },
    {
        "title": "Data Scientist",
        "desc": "Overview:\n\nAre you looking for a role where you can directly influence an organizations business strategy? Do you have a knack for solving problems? Do you want to help drive the results of a multi-million-dollar business? If so, you may have found your next role.\nWe are looking for a self-motivated individual to join our Data Science team to manage the information flow for our organization, including the integrity, efficiency, and availability of data. You will participate in day-to-day design, developing, validating and implementing production scale machine learning and data science models as well as taking an ownership of the model lifecycle. This role will also require developing credible and trusting relationships with senior leaders, managers and employees across the organization. Intellectual curiosity, ownership, and detail-orientation are requirements for the role and the department.\nResponsibilities:\nFormulate business objectives for the model building purposes\nCollect and refine data from various data sources\nConduct exploratory data analysis of considered dataset and identify areas of data validation, quality improvement via cleaning, filtering and applying statistical techniques of numerous bias treatments\nDevelop, implement, numerous experimental and proof of concept approaches for the task\nBe a continuous learner and willing to innovate and bring the latest cutting-edge approaches within the area of algorithms, model designs and model building\nPartners with and interact with Analytics, Technology teams as well as business stakeholders\nPartner with IT to create methods for monitoring, troubleshooting, and resolving data and model issues\nCreate and maintain production scale complete model pipeline\nManage periodic model production runs and be responsible for the ultimate results produced\nMaintain model data documentation, data dictionaries, etc.\nQualifications:\nBasic Qualifications:\nMasters or PhD degree in STEM a plus, or equivalent experience\n~3-5 years of relevant experience in analytics, finance, and/or IT\nStrong technical skills and proficiency in Python programming, machine learning, deep learning, statistical analysis; Bayesian and causal analysis is a big plus\nAbility to manipulate large datasets in a SQL in cloud Service environment is a must\nClose familiarity and experience with Microsoft Azure is a plus\nExperience to provide solutions on the scale of Big Data in PySpark or Scale is a big plus\nStrong analytical skills and proficiency in problem solving; ability to formulate a problem statement, identify and QC needed inputs, and produce and visualize the right outputs is a must\nStrong modelling skills and proficiency in relational databases; ability to create new data systems and improve existing ones is a must.\nFamiliarity with Non-SQL and Graph databases is a plus\nFamiliarity with Knowledge Graphs and understanding Semantic technologies is a plus\nPreferred Qualifications:\nExperience in building production scale models in cloud environment is a big plus\nFamiliarity with key languages, such as SQL, Python, PySpark, R\nFamiliarity with Microsoft Azure Platform products: Azure Synapse, AzureML\nProficiency in data modelling and data visualization tools, such as Power BI, Tableau, Matplotlib\nProficiency in juggling multiple deadlines and managing multiple clients / stakeholders\nProficiency in solving problems while being attentive to details\nExcellent interpersonal and communication skills\nAbility to make the complex simple, and explain model and data through stories\nExperience with financial services is a plus\nA Little About Strategic:\nStrategic Financial Solutions is an award-winning financial services firm dedicated to helping people live a financially healthy life through the products and services we offer.\nWe were recently named as one of the Best Companies to Work for in New York State for the 5th time. Additional honors include being named, two times, as one of the 50 fastest growing companies in New York City and to the prestigious Inc. 500 list as one of the 500 fastest growing companies in the United States. Strategic is 100% employee owned, has offices in Manhattan and Buffalo, to house our rapidly growing family of over 900 associates. In June 2021 we proudly celebrated our 14th anniversary.\nStrategic is committed to hiring, training, cultivating, promoting, and celebrating an environment where we have a welcoming and fulfilling place for all people to call home. Diversity of race, thought, sexual orientation, age, veteran status, religion, and disability will empower us to thrive as individuals, as teams, and as a company.\nLI - Remote",
        "location": "711 3 Ave, New York, NY 10017"
    },
    {
        "title": "newData Scientist",
        "desc": "At Xaqt, we are on a mission to build transformative machine learning-powered products at the intersection of artificial intelligence and customer experience. Our Multiexperience-AI platform uses machine learning across both voice and digital engagement channels to augment and automate human work, radically increasing productivity and improving the efficiency and effectiveness of customer experience teams.As an Xaqt data scientist, you partner with our AI and Platform engineers to design and build the data backbone, dashboards, strategic insights, visualizations and algorithms that drive better decisions across our company and our end customers.This role is WFH which allows most work to be performed at home or on occasion at an Xaqt office location.ResponsibilitiesCreate meaningful interpretation of data through use of tools, industry experience and logic to enable data-driven decision making.Architect and drive to execution analytical products that provide repeatable insights for business stakeholders.Identify and drive delivery of changes in data structures and metrics where needed to further support enhanced analytics.Develop analysis on customer experience and service quality data to improve and optimize contact center performance for our customers.Create predictive data modeling that provides proactive awareness of expected KPI impacts and dashboards that provide performance insights and service quality across the organization.Serve as subject matter expert on all sources of customer and call center agent interaction data.Work closely with our Data Engineers in the ingestion process of customer and agent level data from internal and external sources. This encompasses the full data onboarding journey from hygiene through transforming, aggregating and augmenting the data for the end user usage.Lead the evaluation process of new data sources. Perform data exploration and analysis to determine coverage of new data, to evaluate correlation to key business metrics, to determine the importance of various variables and provide recommendations on whether the data source provides incremental value.Assist in engagements with key business stakeholders in discussions on business strategies and opportunities.Drive technical innovation through active research and application of new theories, techniques, and technologies.Minimum QualificationsContact center knowledge: You are an expert at using data science methods to optimize contact centersFamiliarity with industry leading data science and analytics toolsStrong knowledge of databases and related languages/tools such as PostgresAbility to work with raw data (including big data), knowledge of preprocessing procedures and ability to prepare data for modeling; experience in feature engineeringExperience in Natural Language Processing (NLP)Experience in time-series forecasting preferredExpert in Python and core libraries used by data scientists (Numpy, Scipy, Pandas, Scikit-learn, Matplotlib/Seaborn, etc.)Experience working with large and/or noisy data setsAdditional DetailsMust have legal right to work in the U.S.We provide a wide-selection of health and welfare benefits including medical, dental, vision, life insurance, and supplemental income plans. We also offer a 401(k) Plan.Location: May work from anywhere in the US, but will need to be actively available during core meeting hours from 9:00AM - 5:00PM central time to collaborate with team members across all time zones.Some travel may be requiredJob Type: Full-timePay: $65,000.00 - $110,000.00 per yearBenefits:401(k)Dental insuranceFlexible spending accountHealth insuranceHealth savings accountPaid time offProfessional development assistanceVision insuranceSchedule:Day shiftWork Location: Remote",
        "location": "Chicago"
    },
    {
        "title": "Data Scientist",
        "desc": "Data Scientist  Ground-breaking BiopharmaMy client is a leading innovative Biopharma who are working on the most cutting edge technologies within cell and gene therapies specifically targeting oncology. You will be joining a world leading team of scientists and Data Science professionals based in San Francisco, who are at the top of their game and are constantly pushing the boundaries of what we believe possible within T-Cell research.Roles & Responsibilities:As a Data Scientist you will be working on a novel bioinformatics platform to research personalised T-cell therapies.You will use your knowledge of *omics data analysis to be a key member in developing novel analytical and computational methods for single cell & T-cell datasets.Using your strong communication skills you will be a focal point for interactions between the team and internal stakeholders across the company.Being an expert within Python/R you will be able to write code whilst working within a Linux system.Qualifications & Experience:PhD in Computational Biology or equivalent subject with strong statistical foundationsExperience of RNA and/or DNA sequencingExperience working with single cell or T-cell data setsAbility to write code to a professional standard in a language such as Python or R and experience with relevent modules such as Bioconductor, tidyverse or pandasBenefits:Market Leading SalaryBonusShare optionsHealthcare401K matchIf this role looks of interest or you would like to know about similar positions on our books, please apply now with your CV for a confidential discussion asap.Job Type: Full-timeSalary: $120,000.00 - $140,000.00 per yearBenefits:401(k)Dental insuranceHealth insurancePaid time offVision insuranceSchedule:10 hour shiftSupplemental Pay:Bonus payWork Remotely:Temporarily due to COVID-19",
        "location": "San+Francisco"
    },
    {
        "title": "newData Scientist",
        "desc": "At Xaqt, we are on a mission to build transformative machine learning-powered products at the intersection of artificial intelligence and customer experience. Our Multiexperience-AI platform uses machine learning across both voice and digital engagement channels to augment and automate human work, radically increasing productivity and improving the efficiency and effectiveness of customer experience teams.As an Xaqt data scientist, you partner with our AI and Platform engineers to design and build the data backbone, dashboards, strategic insights, visualizations and algorithms that drive better decisions across our company and our end customers.This role is WFH which allows most work to be performed at home or on occasion at an Xaqt office location.ResponsibilitiesCreate meaningful interpretation of data through use of tools, industry experience and logic to enable data-driven decision making.Architect and drive to execution analytical products that provide repeatable insights for business stakeholders.Identify and drive delivery of changes in data structures and metrics where needed to further support enhanced analytics.Develop analysis on customer experience and service quality data to improve and optimize contact center performance for our customers.Create predictive data modeling that provides proactive awareness of expected KPI impacts and dashboards that provide performance insights and service quality across the organization.Serve as subject matter expert on all sources of customer and call center agent interaction data.Work closely with our Data Engineers in the ingestion process of customer and agent level data from internal and external sources. This encompasses the full data onboarding journey from hygiene through transforming, aggregating and augmenting the data for the end user usage.Lead the evaluation process of new data sources. Perform data exploration and analysis to determine coverage of new data, to evaluate correlation to key business metrics, to determine the importance of various variables and provide recommendations on whether the data source provides incremental value.Assist in engagements with key business stakeholders in discussions on business strategies and opportunities.Drive technical innovation through active research and application of new theories, techniques, and technologies.Minimum QualificationsContact center knowledge: You are an expert at using data science methods to optimize contact centersFamiliarity with industry leading data science and analytics toolsStrong knowledge of databases and related languages/tools such as PostgresAbility to work with raw data (including big data), knowledge of preprocessing procedures and ability to prepare data for modeling; experience in feature engineeringExperience in Natural Language Processing (NLP)Experience in time-series forecasting preferredExpert in Python and core libraries used by data scientists (Numpy, Scipy, Pandas, Scikit-learn, Matplotlib/Seaborn, etc.)Experience working with large and/or noisy data setsAdditional DetailsMust have legal right to work in the U.S.We provide a wide-selection of health and welfare benefits including medical, dental, vision, life insurance, and supplemental income plans. We also offer a 401(k) Plan.Location: May work from anywhere in the US, but will need to be actively available during core meeting hours from 9:00AM - 5:00PM central time to collaborate with team members across all time zones.Some travel may be requiredJob Type: Full-timePay: $65,000.00 - $110,000.00 per yearBenefits:401(k)Dental insuranceFlexible spending accountHealth insuranceHealth savings accountPaid time offProfessional development assistanceVision insuranceSchedule:Day shiftWork Location: Remote",
        "location": "Austin"
    },
    {
        "title": "Data Scientist",
        "desc": "We are adding a Data Scientist to our growing team!\n\n\nABOUT AMERICAN CAPITAL GROUP\n\nAmerican Capital Group is a fully-integrated real estate development company. Over the last 33 years, our company has developed and built more than 80 multifamily properties across twelve states. We remain an industry leader because we know and manage internally Engineering and Design, Acquisition, Development, Construction, Property Management, and Asset Management. We strongly value teamwork, integrity, transparency and producing the highest quality of product for our investors and customers.\n\n\nSUMMARY:\n\nAs Data Scientist at American Capital Group (ACG), your role is to be a pioneer and \"discover,\" collect, process and analyze data with the end goal of making conclusions and recommendations that drastically improve the business. You will bring advanced technology to our industry (development, construction, and acquisition), which historically has been slow to adapt.\n\nIndividuals who thrive at ACG exhibit the following success skills  Collaboration, Critical Thinking, Innovator, Leadership, Energetic, Emotional Intelligence and Intellectual Curiosity, and Results Focus.\n\n\nQUALIFICATIONS:\n\n5-7+ years of experience in a data analysis environment.\nStrong SQL skills. Must have the ability to write complex, highly-optimized queries across large volumes of data\nRelational database management skills\nSolid Python programming skills to create pipelines to cleanse and manipulate data\nStrong ability with Tableau and Excel\nWorking knowledge of CRM systems\nExcellent oral and written communication skills, and comfort presenting\nCuriosity and passion about data, visualization and solving problems\nCreativity to determine the best solution for a real-world problems\nWillingness to question the validity, accuracy of data and assumptions\nDrive and self-reliance, Eagerness to learn, Enjoyment of collaboration\nBachelors Degree\nAbility to be an independent worker with a team player attitude.\nAll candidates must be able to speak, write, and understand English to qualify for this position.\n\n\nRESPONSIBILITIES:\n\n(Included but not limited to)\n\nDesigning and maintaining data models in support of business objectives\nCreate dashboards, reports, visualizations and algorithms to solve interesting business problems and questions.\nCreating ETL pipelines using SQL, SSIS and Python\nUnderstanding your business stakeholders' objectives, the metrics that are the most important to them, and how they measure their performance.\nUse predictive modeling, regression analysis and other statistical analysis tools to evaluate data and form conclusions/projections\nFinding and understanding the correct data sources for a given requirement\nInvestigate a hypothesis, reach data driven conclusions and make recommendations\nCreate dashboards and visualizations using Tableau or other\nPerforms other duties as assigned\nAll candidates must be able to speak, write, and understand English to qualify for this position.\n\n\nLOCATION: Bellevue, Washington - 100% on-site position\n\nJOB TYPE: Full-Time/Exempt\n\nCORE BUSINESS HOURS:: Monday - Friday 7:00am - 4:00pm\n\n(Additional hours and weekend days may be needed to work based on the business needs of the company)\n\nSALARY: $150,000/year (DOE)\n\n\nPRE- EMPLOYMENT SCREENING:\n\nCandidates selected for hire must be able to pass a pre-employment/post-hire drug screen, and background checks along with taking a personality assessment.\n\n\nAMERICAN CAPITAL GROUP IS AN EQUAL OPPORTUNITY EMPLOYER/ AFFIRMATIVE ACTION EMPLOYER\n\nAll qualified candidates will receive consideration for employment without regard to race, color, creed, religion, disability, sex, age, ethnic or national origin, marital status, sexual orientation, gender identity or presentation, pregnancy genetics, veteran status, or any other status protected by state or federal law.\n\nEOE/Minorities/Females/Vet/Disability\n\nPlease find out more about us on our website: www.acg.com",
        "location": "15 Lake Bellevue Dr, Bellevue, WA 98005"
    },
    {
        "title": "newData Scientist Associate-CXI",
        "desc": "Data Scientist Associate-CXI\nLong Beach, CA\nFull-time\nAbout SCAN\nAs one of the nations largest not-for-profit Medicare Advantage plans, serving more than 200,000 members in California, SCAN Health Plan has been a mission-driven organization dedicated to keeping seniors healthy and independent for over 40 years. SCAN employees are passionate about what they do, and understand that success is based on achieving the mission. Employees are afforded with the training and tools necessary to do their jobs and are rewarded for their efforts and recognized as experts in their fields. To learn more, visit scanhealthplan.com or follow us on social media: LinkedIn; Facebook; and Twitter.\nThe Opportunity\nThis role supports SCANs Customer experience and insights (CXI) function. The Data Scientist I will support SCANs analytical efforts to improve the Voice of the Customer using NLP and Predictive Modeling. This role is responsible for end-to-end development and analytics. The Data Scientist I will collaborate with both business and IT leaders to ensure best practices in driving value for our members from data.\nYou Will\nDevelops Topic Models using NLP for Key topics prioritized by the CXI committee for ongoing tracking as a part of the VOC Monitoring efforts.\nSupports business discussions of Topic Model outputs to encourage adoption of VOC monitoring topics built by Data Scientist I\nCleans, processes, and identify areas of improvement for data sets of structured and unstructured data the capture member voice\nIdentifies organization strengths and weaknesses with respect to Data, Analytics, and Insights. Suggests areas of opportunity to support the initiative goals based on this context\nConnects structured and unstructured data across the organization quickly to provided time sensitive data insights. Data sources including operational data, prospect data, call center data, core admin data, provider data, VOC data, clinical data, and external data.\nDelivers Visualizations of relevant analyses to support business understanding\nDevelops Advanced analytics solutions for D&I use cases\nPlans, organizes, and prioritizes assigned projects, creating and managing work plans that reflect the tasks, timeframes, and processes required to successfully complete each project.\nCommunicates effectively with various internal stakeholders and applies project standards.\nActively supports the achievement of SCANs Vision and Goals.\nOther duties as assigned\nRequirements\nYour Qualifications\nBachelors degree in a relevant field required.\nMaster's degree preferred.\n2+ years of experience in analytics and machine learning or graduate degree covering the same topics.\n1+ years of working with Healthcare data preferred.\nAbility to develop analyses and models independently.\nAbility to document processes and analyses for reference/re-use.\nDemonstrated understanding in the areas of big data, analytics infrastructure, cloud computing, data management, customer experience (CX) from a business analyst perspective.\nSeeks and participates in development opportunities above and beyond required training.\nStrong organizational and time management skills.\nCovid-19 Vaccination Policy\nTo ensure a healthy and safe work environment, all SCAN employees will be required to be fully vaccinated by January 1, 2022. Generally, you are considered fully vaccinated 14 days after receiving the last dose, as recommended by the manufacturer, of a vaccine that has been authorized by the FDA for use in the United States, including vaccinations that have been approved pursuant to an Emergency Use Authorization. If fully vaccinated outside of the United States, the vaccination must be listed for emergency use by the World Health Organization (WHO). If you cannot receive the vaccine because of a disability/medical reason or sincerely-held religious belief, you may request an accommodation to this requirement by contacting COVID-19@scanhealthplan.com. Learn more about the COVID-19 vaccination here - https://www.cdc.gov/coronavirus/2019-ncov/vaccines/index.html.\nWhat's in it for you?\nA competitive compensation and benefits program\nAn annual employee bonus program\nRobust Wellness Program\nGenerous paid-time-off (PTO)\nTen paid holidays per year, plus 1 additional floating holiday\nExcellent 403(b) Retirement Saving Plan with employer match\nRobust employee recognition program\nTuition reimbursement\nA work-life balance\nAn opportunity to become part of a team that makes a difference to our members and our community every day!\nWe're always looking for talented people to join our team! Qualified applicants are encouraged to apply now!\nAt SCAN we believe that it is our business to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects our community through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more.\nSCAN is proud to be an Equal Employment Opportunity and Affirmative Action workplace. Individuals seeking employee will receive consideration for employment without regard to race, color, national origin, religion, age, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender perception or identity, age, marital status, disability, protected veteran status or any other status protected by law. A background check is required.\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractors legal duty to furnish information. 41 CFR 60-1.35(c)",
        "location": "3800 Kilroy Airport Way, Long Beach, CA 90806"
    },
    {
        "title": "newData Scientist",
        "desc": "Equity Risk Sciences is recruiting data scientists with SQL, Python and math skills. Candidates must possess some knowledge of the online investment industry. ERS has built investment software (www.ERS.ai) with Excel, MySQL and Azure. Weve designed this software for medium to large institutional investors. Currently, it is very valuable. We will constantly improve it.We seek very capable data scientists to join our small team building world-class investment software.The position can be remote; however, we would like to have occasional face-to-face meetings. Therefore, Ideal candidates will live in Rhode Island, Massachusetts, Connecticut, Metro New York/Philadelphia, or southern Florida (the Tampa or Miami areas).Please submit resume and cover letter to be considered for this position.Job Types: Part-time, ContractSchedule:Monday to FridayApplication Question(s):Do you have past experience or current knowledge of the online investment industry?Education:Bachelor's (Preferred)Experience:Data science: 5 years (Required)MySQL: 2 years (Required)Python: 2 years (Preferred)Work Location: Multiple Locations",
        "location": "Philadelphia"
    },
    {
        "title": "Data Scientist",
        "desc": "Cambridge Technology is seeking a hands-on Data Scientist with the skills to discover the actionable and valuable insights in vast amounts of data. Our customers are diverse and we seek Data Scientists who understand that the real challenge is to find the intersection between actual business problems and ML algorithms. Your primary focus will be on helping to identify business problems of high value that can be solved with data science. Your daily work will be applying ML techniques, performing statistical analysis, and building high-quality prediction systems in production environments.You must be able to apply analytical, statistical, and programming skills to collect, analyze, and interpret large data sets and present the outcomes using various data visualization techniques apt for different kinds of stakeholders.We have a preference for the Python Data Science stack, and experience and familiarity with one or more of the major cloud infrastructure providers.No Of Positions1Skills RequiredSQL, Python Data Science Stack (NumPy, SciPy, Pandas, Scikit-learn, Jupyter, IPython), Machine Learning and Statistics, Data Visualization, A/B Testing, Bandit problems, Recommendation systems, Reinforcement learningFamiliarity with ML and AI services on leading public cloud providers: Amazon SageMaker, Azure ML Studio / Azure ML Services, Google Cloud ML. Speech-to-text, Text-to-speech, Translation, Image/Video Processing, ChatbotsRoles & ResponsibilitiesAbility to work independently to apply technical skills to solve a business objectiveExploratory data analysis employing large data sets involving visualization and basic statistical techniques to develop intuitions and identify key variables in data science projectsData extraction and joining data from multiple sources; SQL is a must; Python preferredStrong familiarity and experience with Machine Learning algorithms; The Python Data Science stack is mandatory; Regression, Clustering, SVM, Decision Trees, DNNs, Recommendation Algorithms, etc.Specific experience sought: real-world A/B testing, multi-armed bandit algorithms, causal inferenceAbility to read and apply, with guidance, cutting edge Machine Learning research papers to solve business problemsHighly analytical with solid expertise in analysis, math, and statistics. Critical thinking, creativity, and problem-solving skills are essential for success in this roleExperience9-15 YearsApplication Deadline: 15/10/2021Expected Start Date: 22/10/2021Job Type: Full-timePay: $74,150.00 - $185,060.00 per yearBenefits:401(k)Dental insuranceEmployee assistance programHealth insuranceLife insuranceProfessional development assistanceSchedule:Monday to FridayEducation:Master's (Preferred)Experience:Python: 3 years (Preferred)SQL: 3 years (Preferred)Work Location:Fully RemoteWork Remotely:Yes",
        "location": "Atlanta"
    },
    {
        "title": "Jr. Data Scientist",
        "desc": "Job Description We're looking for an entry-level Sports, Math, and CS nerd! This person should be excited to solve complex problems by applying the combination of a mathematics background with intuition and the feedback of experts in the field.The successful Jr Data Scientist at Event Dynamic will utilize strong problem-solving skills, programming know-how, and business analytics to solve real-world dynamic pricing problems at scale. This role will be highly involved in the development of the core AI-driven pricing product and will be expected to make key business decisions on complex real-world problems. This position will interface with the subject matter experts and machine learning team to communicate business impacts of technical decisions.Job ResponsibilitiesOnboards new clients into our application utilizing core software application.Identifies areas to continue improving our pricing models and automates their improvement.Collects, creates, ingests, analyzes, evaluates, and iterates through datasets to explore key features, develop training data sets, and create new models.RequirementsA bachelor or masters in a highly quantitative field (Computer Science, Machine Learning, Operational Research, Statistics, Mathematics, Engineering etc.) or equivalent experience.Minimum of two years experience utilizing mathematics and/or machine learning techniques to solve real-world problems.Experience using Python and statistics libraries, pandas preferredExcellent verbal and written communication. Ability to present complex technical findings to a team of subject matter experts.Company DescriptionEvent Dynamics technology is the most sophisticated ticket pricing system in the world. We employ artificial intelligence and advanced mathematics to automate ticket pricing, delivering smart and adaptive prices that puts lost revenue back in the hands of primary rights holders of live events.Job Type: Full-timePay: $60,000.00 - $90,637.00 per yearBenefits:401(k)Dental insuranceFlexible scheduleHealth insurancePaid time offVision insuranceSchedule:Monday to FridayEducation:Bachelor's (Preferred)Experience:Python: 1 year (Preferred)SQL: 1 year (Preferred)Work Location:One locationWork Remotely:Temporarily due to COVID-19Work Location: One location",
        "location": "Event Dynamic in Dallas, TX 75219"
    },
    {
        "title": "Data Scientist",
        "desc": "Med-Immunology - Pennsylvania-Pittsburgh - (21005558)\n\nThe Computational Immunogenomics Core in the Department of Immunology is hiring a Data Scientist. The Data Scientist will be responsible for developing and applying cutting-edge data analyses and visualization approaches towards immune-genomics studies at the Computational Immunogenomics core. The candidate will work with computational scientists and experimental biologists' teams from immunology, computational biology, immune engineering, and systems biology to support analyzing bulk- and single-cell multi-omics datasets.\n\nAt least a Master's degree in computer science, bioinformatics, genomics or a related quantitative field required. A PhD is preferred.\n\nThe University of Pittsburgh is an Affirmative Action/Equal Opportunity Employer and values equality of opportunity, human dignity and diversity. EOE, including disability/vets\n\nAssignment Category Full-time regular\nJob Classification Staff.Research.V\nCampus Pittsburgh\nMinimum Education Level Required Master's\nMinimum Experience Level Required 5-6 years experience\nWork Schedule Monday-Friday, 8:30 a.m.- 5:00 p.m.\nHiring Range TBD based upon qualifications\nRelocation Offered No\nVisa Sponsorship Provided Yes\nBackground Check For position finalists, employment with the University will require successful completion of a background check\nChild Protection Clearances Not Applicable\nPI153690130",
        "location": "4200 Fifth Avenue, Pittsburgh, PA 15260"
    },
    {
        "title": "newSenior Data Scientist, Emerging Areas Open to remote work, e...",
        "desc": "Become a Part of the NIKE, Inc. Team\n\nNIKE, Inc. does more than outfit the worlds best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. its about each person bringing skills and passion to a challenging and constantly evolving game.\nWHO ARE WE LOOKING FOR\nWe are looking for an entrepreneurial, product-minded data scientist who is passionate about working on novel applications of data science within Nikes. Examples of emerging areas include data science for digital product design, interactive retail experiences, and sports marketing. The goal is to lay the foundation over the next few years for leveraging data and data science at scale within these spaces.\n\n\nWHAT WILL YOU WORK ON\nIn this role, you will\nContribute to all stages of model development, from creating proof-of-concepts and beta testing, to partnering with data engineering, machine learning platform, and product teams to deploy algorithms, evaluate the A/B test results and deliver value in alignment with roadmap and business needs.\nStrive to constantly improve model performance using insights from rigorous offline and online experimentation.\nAdhere to software engineering best practices and contribute to shared code repositories.\nDocument modeling work and present to stakeholders and other technical and non-technical partners.\nParticipate in the broader data science community within Nike, including data science labs, study groups and team activities.\nWHO WILL YOU WORK WITH\nYou will be a member of the Emerging Areas Data Science team. This team is part of Nikes Consumer Data Science team and Insights function. So you will be a member of the broader data science team at Nike, and participate in our data science labs, study groups, team activities, and attend conferences.\nWHAT YOU BRING\n\n\n\n3+ years of demonstrated experience developing and delivering effective machine learning and/or statistical models to serve business needs. Will accept suitable combination of education and experience.\nExperience developing models for production scale highly desirable.\nProficiency in Python required.\n\nExcellent data wrangling skills. SQL required. Working knowledge of Spark is a plus.\n\nExpertise in recommender systems and e-commerce is highly desired.\nExcellent communication skills and the ability to collaborate effectively cross-functionally required.\nExperience presenting to both technical and non-technical audiences and a history of publications or presentations at conferences is a plus.\nA degree in computer science, statistics, applied math, physics, or other quantitative discipline, (Masters or PhD). Will accept suitable combination of education and experience\nOpen to remote work, except cannot work in Colorado, South Dakota, Vermont, and West Virginia. These candidates will be required to relocate.\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.",
        "location": "Portland"
    },
    {
        "title": "Data Scientist",
        "desc": "About the Role:The position creates new footprint for data-driven innovation and value for our customers and prospects while providing analytical capabilities. You would be part of core team that would help design and develop advanced analytics solutions across functional areas as per client requirement/opportunities. Key requirements include an ability to communicate complex quantitative analysis with a lucid, precise, clear and actionable insight. You should be experienced in solving analytical problems using quantitative approaches. You would also invest your time in developing new practices and methodologies using statistical methods, machine learning and predictive models under mentorship from experts across industry.You will:Identify and manage the analysis and interpretation of clients' internal and external data to drive decision making.Query databases and perform statistical, mathematical analysisWork directly with customer teams to help design and generation of reporting frameworks that provide insight to the performance of clients business programs.Create re-usable implementations of statistical tests and models (R, Python, SAS, SPSS etc.) using the available technologies.Assist in customer engagement management, project scoping, timeline management, and results documentation to ensure professional relationship management.You have:Must have sound understanding of industrial systems particularly in design, manufacturing, test, operations, supply chain, aftermarket and MRO.Must be strong on learning methods, data analytics, R/Python and Tableau.Good in algorithm development with programming languages.Must have strong understanding of statistics and machine learning.Prior experience in R or Python and data analytics is preferred.Education:MS/PhD in Mechanical, Electrical, Computer Science or Aerospace Engineering from an accredited school with focus on Image/Signal processing and Computer VisionApplicable experienceCyient_indeedJob Type: Full-timeSalary: From $1.00 per yearSchedule:Monday to FridayWork Location:One locationCompany's website:www.cyient.comWork Remotely:Temporarily due to COVID-19COVID-19 Precaution(s):Remote interview processPersonal protective equipment provided or requiredPlastic shield at work stationsTemperature screeningsSocial distancing guidelines in placeVirtual meetingsSanitizing, disinfecting, or cleaning procedures in placeWork Location: One location",
        "location": "Phoenix"
    },
    {
        "title": "newData Scientist",
        "desc": "At Xaqt, we are on a mission to build transformative machine learning-powered products at the intersection of artificial intelligence and customer experience. Our Multiexperience-AI platform uses machine learning across both voice and digital engagement channels to augment and automate human work, radically increasing productivity and improving the efficiency and effectiveness of customer experience teams.As an Xaqt data scientist, you partner with our AI and Platform engineers to design and build the data backbone, dashboards, strategic insights, visualizations and algorithms that drive better decisions across our company and our end customers.This role is WFH which allows most work to be performed at home or on occasion at an Xaqt office location.ResponsibilitiesCreate meaningful interpretation of data through use of tools, industry experience and logic to enable data-driven decision making.Architect and drive to execution analytical products that provide repeatable insights for business stakeholders.Identify and drive delivery of changes in data structures and metrics where needed to further support enhanced analytics.Develop analysis on customer experience and service quality data to improve and optimize contact center performance for our customers.Create predictive data modeling that provides proactive awareness of expected KPI impacts and dashboards that provide performance insights and service quality across the organization.Serve as subject matter expert on all sources of customer and call center agent interaction data.Work closely with our Data Engineers in the ingestion process of customer and agent level data from internal and external sources. This encompasses the full data onboarding journey from hygiene through transforming, aggregating and augmenting the data for the end user usage.Lead the evaluation process of new data sources. Perform data exploration and analysis to determine coverage of new data, to evaluate correlation to key business metrics, to determine the importance of various variables and provide recommendations on whether the data source provides incremental value.Assist in engagements with key business stakeholders in discussions on business strategies and opportunities.Drive technical innovation through active research and application of new theories, techniques, and technologies.Minimum QualificationsContact center knowledge: You are an expert at using data science methods to optimize contact centersFamiliarity with industry leading data science and analytics toolsStrong knowledge of databases and related languages/tools such as PostgresAbility to work with raw data (including big data), knowledge of preprocessing procedures and ability to prepare data for modeling; experience in feature engineeringExperience in Natural Language Processing (NLP)Experience in time-series forecasting preferredExpert in Python and core libraries used by data scientists (Numpy, Scipy, Pandas, Scikit-learn, Matplotlib/Seaborn, etc.)Experience working with large and/or noisy data setsAdditional DetailsMust have legal right to work in the U.S.We provide a wide-selection of health and welfare benefits including medical, dental, vision, life insurance, and supplemental income plans. We also offer a 401(k) Plan.Location: May work from anywhere in the US, but will need to be actively available during core meeting hours from 9:00AM - 5:00PM central time to collaborate with team members across all time zones.Some travel may be requiredJob Type: Full-timePay: $65,000.00 - $110,000.00 per yearBenefits:401(k)Dental insuranceFlexible spending accountHealth insuranceHealth savings accountPaid time offProfessional development assistanceVision insuranceSchedule:Day shiftWork Location: Remote",
        "location": "Denver"
    },
    {
        "title": "Clinical Data Scientist",
        "desc": "Job Summary: Data mining of genomics data and clinical record. The work can be remote.Essential Duties and Responsibilities:*DUTIES AND RESPONSIBILITIES: *Conduct research on large datasetsDiscover novel patterns with statistically significanceProvide models to guidance clinical product developmentJob Skills: Knowledge of structured or unstructured dataset, by which to select training sets for machinelearningPresentation skills to present results and insights to leadershipWritten and verbal communication skillsQualifications: Master of Science or PhD in a quantitative discipline like Computer Science, statistics, andbiomedical science, etc.Scientific mindset and first-principles thinkingPrior experience in conducting academic or industry research on data mining, especially onelectronic health records and/or genomicsJob Type: Full-time",
        "location": "Houston"
    },
    {
        "title": "newDATA SCIENTIST APPRENTICESHIP",
        "desc": "TO apply use this link: https://worlddatascience.tech/applyWe will not reply to any correspondence on this website, if you do not apply with above link we will never see your application!The World Data Science Institute is a Startup that Specializes in building Blockchain and Financial Technology Applications!Our Flagship project is Crypto $hare!We are currently looking for a team of Data Science Professionals to be Apprentices for our Startup!If you do well we offer you a 1 month contract for $ 1000.START DATE: DECEMBER 15 - FEBRUARY 23 2021HOLIDAY BREAK: DECEMBER 23 - DECEMBER 2You will be given a task and if you complete it correctly you will be offered a spot within our Apprenticeship!We will train all finalists and hire our top participants (paid in equity shares of our company)! This Cohort also can be used to satisfy Internship requirements!Maximum of 20 hours (for 10 weeks) worth of World Data Science Institute Activities per week!This is a UNPAID Training Program (with an opportunity to get hired as a Contractor after successful completion of program)!Duracin del contrato: 3 mesesFecha lmite para postularse: 1/12/2021Fecha de inicio prevista: 15/12/2021Job Types: Part-time, Internship, ContractPay: $1.00 - $1,000.00 per monthWork Remotely:Yes",
        "location": "Miami"
    },
    {
        "title": "Geospatial Data Scientist",
        "desc": "Geospatial Data Scientist Geospatial Data ScientistEpochGeo is looking for a Geospatial Data Scientist to support one of the most innovative, exciting, and growing offices that is rooted in geospatial analytics in the national security space.Are you a technical geographer who loves to work with data, find patterns in it, and then turn it into actionable intelligence? Are you a data scientist who loves to draw out insights from data, and work with analysts and engineers to turn those insights into automated workflows? If so, please reach out to us at EpochGeo to chat.Location-based big data can be overwhelming, inaccessible, and noisy. EpochGeo is a data services firm specializing in supporting the full spectrum data cycle: beginning with scalable data storage, building algorithms or workflows, and ending with impactful analytics. Our developers, analysts, and data scientists have a proven track record applying open-source innovative technology, data science, and actionable analytics to inform customers data driven decisions.Your background likely includes: 2 - 5+ years of experience working in data analytics, data science -- to include, geospatial modeling, predictive analysis, time series analysis, machine learning, and/or AI.Education or military experience in Geography, Data Science, Computer Science, Economics, Mathematics, or Statistics.Must have Python or R, and SQL experience, and have experience applying it to client requirements.Experience with large volume geospatial data, multi-INT analytics, or automated analytics.Intel Analyst Experience in any of the following disciplines is a plus: open source exploitation, targeting, geospatial intelligence products, or statistical analysis.What you will be doing: Work with multiple data information types to; deconstruct key questions, leverage spatial data, exploit APIs, recommend methodologies, and develop algorithms.Create automated workflows or algorithms and machine learning models from big data to discover insights.Collaborate with software engineers to implement distributed/scalable algorithms.Exploit multiple geospatial big data environments for insights that can be automated at scale.Bonus: Professional Certificate or Masters degree in Data Science, Geography, Mathematics, etc.Additional: Must hold a DoD TS clearanceBenefits Include: Health care, FSA, HSA401k: 6% match, immediate vesting14 holidays: All 11 Federal holidays, day after Thanksgiving, 24 DEC, 31 DECPTO: 4 weeks annually3 week sabbatical every 3 years with the companyJob Type: Full-timePay: $145,000.00 - $175,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offReferral programRetirement planVision insuranceSchedule:8 hour shiftSupplemental Pay:Bonus payEducation:High school or equivalent (Required)Experience:Python: 2 years (Required)SQL: 1 year (Preferred)Security clearance:Top Secret (Required)Work Location: Multiple Locations",
        "location": "Washington+DC"
    },
    {
        "title": "newData Scientist",
        "desc": "At Xaqt, we are on a mission to build transformative machine learning-powered products at the intersection of artificial intelligence and customer experience. Our Multiexperience-AI platform uses machine learning across both voice and digital engagement channels to augment and automate human work, radically increasing productivity and improving the efficiency and effectiveness of customer experience teams.As an Xaqt data scientist, you partner with our AI and Platform engineers to design and build the data backbone, dashboards, strategic insights, visualizations and algorithms that drive better decisions across our company and our end customers.This role is WFH which allows most work to be performed at home or on occasion at an Xaqt office location.ResponsibilitiesCreate meaningful interpretation of data through use of tools, industry experience and logic to enable data-driven decision making.Architect and drive to execution analytical products that provide repeatable insights for business stakeholders.Identify and drive delivery of changes in data structures and metrics where needed to further support enhanced analytics.Develop analysis on customer experience and service quality data to improve and optimize contact center performance for our customers.Create predictive data modeling that provides proactive awareness of expected KPI impacts and dashboards that provide performance insights and service quality across the organization.Serve as subject matter expert on all sources of customer and call center agent interaction data.Work closely with our Data Engineers in the ingestion process of customer and agent level data from internal and external sources. This encompasses the full data onboarding journey from hygiene through transforming, aggregating and augmenting the data for the end user usage.Lead the evaluation process of new data sources. Perform data exploration and analysis to determine coverage of new data, to evaluate correlation to key business metrics, to determine the importance of various variables and provide recommendations on whether the data source provides incremental value.Assist in engagements with key business stakeholders in discussions on business strategies and opportunities.Drive technical innovation through active research and application of new theories, techniques, and technologies.Minimum QualificationsContact center knowledge: You are an expert at using data science methods to optimize contact centersFamiliarity with industry leading data science and analytics toolsStrong knowledge of databases and related languages/tools such as PostgresAbility to work with raw data (including big data), knowledge of preprocessing procedures and ability to prepare data for modeling; experience in feature engineeringExperience in Natural Language Processing (NLP)Experience in time-series forecasting preferredExpert in Python and core libraries used by data scientists (Numpy, Scipy, Pandas, Scikit-learn, Matplotlib/Seaborn, etc.)Experience working with large and/or noisy data setsAdditional DetailsMust have legal right to work in the U.S.We provide a wide-selection of health and welfare benefits including medical, dental, vision, life insurance, and supplemental income plans. We also offer a 401(k) Plan.Location: May work from anywhere in the US, but will need to be actively available during core meeting hours from 9:00AM - 5:00PM central time to collaborate with team members across all time zones.Some travel may be requiredJob Type: Full-timePay: $65,000.00 - $110,000.00 per yearBenefits:401(k)Dental insuranceFlexible spending accountHealth insuranceHealth savings accountPaid time offProfessional development assistanceVision insuranceSchedule:Day shiftWork Location: Remote",
        "location": "Boulder"
    }
]